feilongfl/hal_artery/include/dt-bindings/pinctrl/at32f437r(c-g-m)xx-pinctrl.h
/* OTG1_D- */
#define OTG1_D-_PA11 \
	GD32_PINMUX_AF('A', 11, AF10)

/* OTG1_ID */
#define OTG1_ID_PA10 \
	GD32_PINMUX_AF('A', 10, AF10)

/* OTG1_OE */
#define OTG1_OE_PA13 \
	GD32_PINMUX_AF('A', 13, AF10)

/* OTG1_SOF */
#define OTG1_SOF_PA8 \
	GD32_PINMUX_AF('A', 8, AF10)

/* OTG1_VBUS */
#define OTG1_VBUS_PA9 \
	GD32_PINMUX_AF('A', 9, AF10)

/* OTG2_D+ */
#define OTG2_D+_PB15 \
	GD32_PINMUX_AF('B', 15, AF12)

/* OTG2_D- */
#define OTG2_D-_PB14 \
	GD32_PINMUX_AF('B', 14, AF12)

/* OTG2_ID */
#define OTG2_ID_PB12 \
	GD32_PINMUX_AF('B', 12, AF12)

/* OTG2_OE */
#define OTG2_OE_PC9 \
	GD32_PINMUX_AF('C', 9, AF11)

/* OTG2_SOF */
#define OTG2_SOF_PA4 \
	GD32_PINMUX_AF('A', 4, AF12)

/* OTG2_VBUS */
#define OTG2_VBUS_PB13 \
	GD32_PINMUX_AF('B', 13, AF12)

/* QSPI1_CS */
#define QSPI1_CS_PB10 \
	GD32_PINMUX_AF('B', 10, AF9)
#define QSPI1_CS_PB6 \
	GD32_PINMUX_AF('B', 6, AF10)
#define QSPI1_CS_PB9 \
	GD32_PINMUX_AF('B', 9, AF10)
#define QSPI1_CS_PC11 \
	GD32_PINMUX_AF('C', 11, AF9)
#define QSPI1_CS_PG6 \
	GD32_PINMUX_AF('G', 6, AF10)

/* QSPI1_IO0 */
#define QSPI1_IO0_PA6 \
	GD32_PINMUX_AF('A', 6, AF10)
#define QSPI1_IO0_PB0 \
	GD32_PINMUX_AF('B', 0, AF10)
#define QSPI1_IO0_PB11 \
	GD32_PINMUX_AF('B', 11, AF10)
#define QSPI1_IO0_PC9 \
	GD32_PINMUX_AF('C', 9, AF9)
#define QSPI1_IO0_PD11 \
	GD32_PINMUX_AF('D', 11, AF9)
#define QSPI1_IO0_PF8 \
	GD32_PINMUX_AF('F', 8, AF10)
#define QSPI1_IO0_PH2 \
	GD32_PINMUX_AF('H', 2, AF10)

/* QSPI1_IO1 */
#define QSPI1_IO1_PA7 \
	GD32_PINMUX_AF('A', 7, AF10)
#define QSPI1_IO1_PB10 \
	GD32_PINMUX_AF('B', 10, AF10)
#define QSPI1_IO1_PC10 \
	GD32_PINMUX_AF('C', 10, AF9)
#define QSPI1_IO1_PD12 \
	GD32_PINMUX_AF('D', 12, AF9)
#define QSPI1_IO1_PH3 \
	GD32_PINMUX_AF('H', 3, AF10)

/* QSPI1_IO2 */
#define QSPI1_IO2_PA15 \
	GD32_PINMUX_AF('A', 15, AF10)
#define QSPI1_IO2_PC4 \
	GD32_PINMUX_AF('C', 4, AF10)
#define QSPI1_IO2_PC8 \
	GD32_PINMUX_AF('C', 8, AF9)
#define QSPI1_IO2_PE2 \
	GD32_PINMUX_AF('E', 2, AF9)
#define QSPI1_IO2_PF7 \
	GD32_PINMUX_AF('F', 7, AF9)
#define QSPI1_IO2_PG9 \
	GD32_PINMUX_AF('G', 9, AF9)

/* QSPI1_IO3 */
#define QSPI1_IO3_PA1 \
	GD32_PINMUX_AF('A', 1, AF9)
#define QSPI1_IO3_PB3 \
	GD32_PINMUX_AF('B', 3, AF10)
#define QSPI1_IO3_PC5 \
	GD32_PINMUX_AF('C', 5, AF10)
#define QSPI1_IO3_PD13 \
	GD32_PINMUX_AF('D', 13, AF9)
#define QSPI1_IO3_PF6 \
	GD32_PINMUX_AF('F', 6, AF9)
#define QSPI1_IO3_PG14 \
	GD32_PINMUX_AF('G', 14, AF9)

/* QSPI1_MOSI_IO1 */
#define QSPI1_MOSI_IO1_PF9 \
	GD32_PINMUX_AF('F', 9, AF10)

/* QSPI1_SCK */
#define QSPI1_SCK_PB1 \
	GD32_PINMUX_AF('B', 1, AF9)
#define QSPI1_SCK_PB2 \
	GD32_PINMUX_AF('B', 2, AF9)
#define QSPI1_SCK_PD3 \
	GD32_PINMUX_AF('D', 3, AF9)
#define QSPI1_SCK_PF10 \
	GD32_PINMUX_AF('F', 10, AF9)

/* QSPI2_CS */
#define QSPI2_CS_PB8 \
	GD32_PINMUX_AF('B', 8, AF10)
#define QSPI2_CS_PG8 \
	GD32_PINMUX_AF('G', 8, AF5)

/* QSPI2_IO0 */
#define QSPI2_IO0_PB0 \
	GD32_PINMUX_AF('B', 0, AF9)
#define QSPI2_IO0_PE7 \
	GD32_PINMUX_AF('E', 7, AF10)
#define QSPI2_IO0_PG14 \
	GD32_PINMUX_AF('G', 14, AF5)

/* QSPI2_IO1 */
#define QSPI2_IO1_PA15 \
	GD32_PINMUX_AF('A', 15, AF9)
#define QSPI2_IO1_PB7 \
	GD32_PINMUX_AF('B', 7, AF9)
#define QSPI2_IO1_PC3 \
	GD32_PINMUX_AF('C', 3, AF9)
#define QSPI2_IO1_PE8 \
	GD32_PINMUX_AF('E', 8, AF10)
#define QSPI2_IO1_PG12 \
	GD32_PINMUX_AF('G', 12, AF5)

/* QSPI2_IO2 */
#define QSPI2_IO2_PA5 \
	GD32_PINMUX_AF('A', 5, AF9)
#define QSPI2_IO2_PE9 \
	GD32_PINMUX_AF('E', 9, AF10)
#define QSPI2_IO2_PG10 \
	GD32_PINMUX_AF('G', 10, AF5)

/* QSPI2_IO3 */
#define QSPI2_IO3_PA3 \
	GD32_PINMUX_AF('A', 3, AF9)
#define QSPI2_IO3_PE10 \
	GD32_PINMUX_AF('E', 10, AF10)
#define QSPI2_IO3_PG11 \
	GD32_PINMUX_AF('G', 11, AF5)

/* QSPI2_SCK */
#define QSPI2_SCK_PB1 \
	GD32_PINMUX_AF('B', 1, AF10)
#define QSPI2_SCK_PG13 \
	GD32_PINMUX_AF('G', 13, AF5)

/* SDIO1_CK */
#define SDIO1_CK_PB15 \
	GD32_PINMUX_AF('B', 15, AF13)
#define SDIO1_CK_PB2 \
	GD32_PINMUX_AF('B', 2, AF12)
#define SDIO1_CK_PC12 \
	GD32_PINMUX_AF('C', 12, AF12)

/* SDIO1_CMD */
#define SDIO1_CMD_PA6 \
	GD32_PINMUX_AF('A', 6, AF12)
#define SDIO1_CMD_PD2 \
	GD32_PINMUX_AF('D', 2, AF12)

/* SDIO1_D0 */
#define SDIO1_D0_PB4 \
	GD32_PINMUX_AF('B', 4, AF12)
#define SDIO1_D0_PB6 \
	GD32_PINMUX_AF('B', 6, AF14)
#define SDIO1_D0_PB7 \
	GD32_PINMUX_AF('B', 7, AF14)
#define SDIO1_D0_PC8 \
	GD32_PINMUX_AF('C', 8, AF12)

/* SDIO1_D1 */
#define SDIO1_D1_PA8 \
	GD32_PINMUX_AF('A', 8, AF12)
#define SDIO1_D1_PB0 \
	GD32_PINMUX_AF('B', 0, AF12)
#define SDIO1_D1_PC9 \
	GD32_PINMUX_AF('C', 9, AF12)

/* SDIO1_D2 */
#define SDIO1_D2_PA9 \
	GD32_PINMUX_AF('A', 9, AF12)
#define SDIO1_D2_PB1 \
	GD32_PINMUX_AF('B', 1, AF12)
#define SDIO1_D2_PC10 \
	GD32_PINMUX_AF('C', 10, AF12)

/* SDIO1_D3 */
#define SDIO1_D3_PB5 \
	GD32_PINMUX_AF('B', 5, AF14)
#define SDIO1_D3_PC11 \
	GD32_PINMUX_AF('C', 11, AF12)

/* SDIO1_D4 */
#define SDIO1_D4_PB8 \
	GD32_PINMUX_AF('B', 8, AF12)

/* SDIO1_D5 */
#define SDIO1_D5_PB9 \
	GD32_PINMUX_AF('B', 9, AF12)

/* SDIO1_D6 */
#define SDIO1_D6_PB14 \
	GD32_PINMUX_AF('B', 14, AF13)
#define SDIO1_D6_PC6 \
	GD32_PINMUX_AF('C', 6, AF12)

/* SDIO1_D7 */
#define SDIO1_D7_PB10 \
	GD32_PINMUX_AF('B', 10, AF12)
#define SDIO1_D7_PC7 \
	GD32_PINMUX_AF('C', 7, AF12)

/* SDIO2_CK */
#define SDIO2_CK_PA2 \
	GD32_PINMUX_AF('A', 2, AF10)
#define SDIO2_CK_PC4 \
	GD32_PINMUX_AF('C', 4, AF13)

/* SDIO2_CMD */
#define SDIO2_CMD_PA3 \
	GD32_PINMUX_AF('A', 3, AF10)
#define SDIO2_CMD_PC5 \
	GD32_PINMUX_AF('C', 5, AF13)

/* SDIO2_D0 */
#define SDIO2_D0_PA4 \
	GD32_PINMUX_AF('A', 4, AF11)
#define SDIO2_D0_PC0 \
	GD32_PINMUX_AF('C', 0, AF10)

/* SDIO2_D1 */
#define SDIO2_D1_PA5 \
	GD32_PINMUX_AF('A', 5, AF11)
#define SDIO2_D1_PC1 \
	GD32_PINMUX_AF('C', 1, AF10)

/* SDIO2_D2 */
#define SDIO2_D2_PA6 \
	GD32_PINMUX_AF('A', 6, AF11)
#define SDIO2_D2_PC2 \
	GD32_PINMUX_AF('C', 2, AF10)

/* SDIO2_D3 */
#define SDIO2_D3_PA7 \
	GD32_PINMUX_AF('A', 7, AF13)
#define SDIO2_D3_PC3 \
	GD32_PINMUX_AF('C', 3, AF10)

/* SDIO2_D4 */
#define SDIO2_D4_PA4 \
	GD32_PINMUX_AF('A', 4, AF10)

/* SDIO2_D5 */
#define SDIO2_D5_PA5 \
	GD32_PINMUX_AF('A', 5, AF10)

