feilongfl/hal_artery/include/dt-bindings/pinctrl/at32f437r(c-g-m)xx-pinctrl.h
/* SDIO2_D6 */
#define SDIO2_D6_PA6 \
	GD32_PINMUX_AF('A', 6, AF14)

/* SDIO2_D7 */
#define SDIO2_D7_PA7 \
	GD32_PINMUX_AF('A', 7, AF14)

/* SPI1_CS */
#define SPI1_CS_PA15 \
	GD32_PINMUX_AF('A', 15, AF5)
#define SPI1_CS_PA4 \
	GD32_PINMUX_AF('A', 4, AF5)
#define SPI1_CS_PE12 \
	GD32_PINMUX_AF('E', 12, AF4)

/* SPI1_MISO */
#define SPI1_MISO_PA6 \
	GD32_PINMUX_AF('A', 6, AF5)
#define SPI1_MISO_PB4 \
	GD32_PINMUX_AF('B', 4, AF5)
#define SPI1_MISO_PE14 \
	GD32_PINMUX_AF('E', 14, AF4)
#define SPI1_MISO_PG0 \
	GD32_PINMUX_AF('G', 0, AF5)

/* SPI1_MOSI */
#define SPI1_MOSI_PA7 \
	GD32_PINMUX_AF('A', 7, AF5)
#define SPI1_MOSI_PB5 \
	GD32_PINMUX_AF('B', 5, AF5)
#define SPI1_MOSI_PE15 \
	GD32_PINMUX_AF('E', 15, AF4)
#define SPI1_MOSI_PG1 \
	GD32_PINMUX_AF('G', 1, AF5)

/* SPI1_SCK */
#define SPI1_SCK_PA5 \
	GD32_PINMUX_AF('A', 5, AF5)
#define SPI1_SCK_PB3 \
	GD32_PINMUX_AF('B', 3, AF5)
#define SPI1_SCK_PE13 \
	GD32_PINMUX_AF('E', 13, AF4)

/* SPI2_CS */
#define SPI2_CS_PA11 \
	GD32_PINMUX_AF('A', 11, AF5)
#define SPI2_CS_PB12 \
	GD32_PINMUX_AF('B', 12, AF5)
#define SPI2_CS_PB9 \
	GD32_PINMUX_AF('B', 9, AF5)
#define SPI2_CS_PD0 \
	GD32_PINMUX_AF('D', 0, AF7)
#define SPI2_CS_PD1 \
	GD32_PINMUX_AF('D', 1, AF7)

/* SPI2_MISO */
#define SPI2_MISO_PA12 \
	GD32_PINMUX_AF('A', 12, AF5)
#define SPI2_MISO_PB14 \
	GD32_PINMUX_AF('B', 14, AF5)
#define SPI2_MISO_PC2 \
	GD32_PINMUX_AF('C', 2, AF5)
#define SPI2_MISO_PD3 \
	GD32_PINMUX_AF('D', 3, AF6)

/* SPI2_MOSI */
#define SPI2_MOSI_PA10 \
	GD32_PINMUX_AF('A', 10, AF5)
#define SPI2_MOSI_PB15 \
	GD32_PINMUX_AF('B', 15, AF5)
#define SPI2_MOSI_PC1 \
	GD32_PINMUX_AF('C', 1, AF7)
#define SPI2_MOSI_PC3 \
	GD32_PINMUX_AF('C', 3, AF5)
#define SPI2_MOSI_PD4 \
	GD32_PINMUX_AF('D', 4, AF6)

/* SPI2_SCK */
#define SPI2_SCK_PA9 \
	GD32_PINMUX_AF('A', 9, AF5)
#define SPI2_SCK_PB1 \
	GD32_PINMUX_AF('B', 1, AF6)
#define SPI2_SCK_PB10 \
	GD32_PINMUX_AF('B', 10, AF5)
#define SPI2_SCK_PB13 \
	GD32_PINMUX_AF('B', 13, AF5)
#define SPI2_SCK_PC7 \
	GD32_PINMUX_AF('C', 7, AF5)
#define SPI2_SCK_PD1 \
	GD32_PINMUX_AF('D', 1, AF6)
#define SPI2_SCK_PD3 \
	GD32_PINMUX_AF('D', 3, AF5)

/* SPI3_CS */
#define SPI3_CS_PA15 \
	GD32_PINMUX_AF('A', 15, AF6)
#define SPI3_CS_PA4 \
	GD32_PINMUX_AF('A', 4, AF6)

/* SPI3_MISO */
#define SPI3_MISO_PA13 \
	GD32_PINMUX_AF('A', 13, AF6)
#define SPI3_MISO_PB4 \
	GD32_PINMUX_AF('B', 4, AF6)
#define SPI3_MISO_PC11 \
	GD32_PINMUX_AF('C', 11, AF6)

/* SPI3_MOSI */
#define SPI3_MOSI_PA14 \
	GD32_PINMUX_AF('A', 14, AF6)
#define SPI3_MOSI_PB0 \
	GD32_PINMUX_AF('B', 0, AF7)
#define SPI3_MOSI_PB2 \
	GD32_PINMUX_AF('B', 2, AF7)
#define SPI3_MOSI_PB5 \
	GD32_PINMUX_AF('B', 5, AF6)
#define SPI3_MOSI_PC1 \
	GD32_PINMUX_AF('C', 1, AF5)
#define SPI3_MOSI_PC12 \
	GD32_PINMUX_AF('C', 12, AF6)
#define SPI3_MOSI_PD0 \
	GD32_PINMUX_AF('D', 0, AF6)
#define SPI3_MOSI_PD6 \
	GD32_PINMUX_AF('D', 6, AF5)

/* SPI3_SCK */
#define SPI3_SCK_PB12 \
	GD32_PINMUX_AF('B', 12, AF7)
#define SPI3_SCK_PB3 \
	GD32_PINMUX_AF('B', 3, AF6)
#define SPI3_SCK_PC10 \
	GD32_PINMUX_AF('C', 10, AF6)

/* SPI4_CS */
#define SPI4_CS_PB12 \
	GD32_PINMUX_AF('B', 12, AF6)
#define SPI4_CS_PB6 \
	GD32_PINMUX_AF('B', 6, AF6)
#define SPI4_CS_PE11 \
	GD32_PINMUX_AF('E', 11, AF5)
#define SPI4_CS_PE4 \
	GD32_PINMUX_AF('E', 4, AF5)
#define SPI4_CS_PG14 \
	GD32_PINMUX_AF('G', 14, AF6)

/* SPI4_MISO */
#define SPI4_MISO_PA11 \
	GD32_PINMUX_AF('A', 11, AF6)
#define SPI4_MISO_PB8 \
	GD32_PINMUX_AF('B', 8, AF6)
#define SPI4_MISO_PD0 \
	GD32_PINMUX_AF('D', 0, AF5)
#define SPI4_MISO_PE13 \
	GD32_PINMUX_AF('E', 13, AF5)
#define SPI4_MISO_PE5 \
	GD32_PINMUX_AF('E', 5, AF5)
#define SPI4_MISO_PG12 \
	GD32_PINMUX_AF('G', 12, AF6)

/* SPI4_MOSI */
#define SPI4_MOSI_PA1 \
	GD32_PINMUX_AF('A', 1, AF5)
#define SPI4_MOSI_PB9 \
	GD32_PINMUX_AF('B', 9, AF6)
#define SPI4_MOSI_PE14 \
	GD32_PINMUX_AF('E', 14, AF5)
#define SPI4_MOSI_PE6 \
	GD32_PINMUX_AF('E', 6, AF5)
#define SPI4_MOSI_PG13 \
	GD32_PINMUX_AF('G', 13, AF6)

/* SPI4_SCK */
#define SPI4_SCK_PB13 \
	GD32_PINMUX_AF('B', 13, AF6)
#define SPI4_SCK_PB7 \
	GD32_PINMUX_AF('B', 7, AF6)
#define SPI4_SCK_PE12 \
	GD32_PINMUX_AF('E', 12, AF5)
#define SPI4_SCK_PE2 \
	GD32_PINMUX_AF('E', 2, AF5)
#define SPI4_SCK_PG11 \
	GD32_PINMUX_AF('G', 11, AF6)

/* SWCLK */
#define SWCLK_PA14 \
	GD32_PINMUX_AF('A', 14, AF0)

/* SWDIO */
#define SWDIO_PA13 \
	GD32_PINMUX_AF('A', 13, AF0)

/* SWO */
#define SWO_PB3 \
	GD32_PINMUX_AF('B', 3, AF0)

/* TMR10_CH1 */
#define TMR10_CH1_PB8 \
	GD32_PINMUX_AF('B', 8, AF3)
#define TMR10_CH1_PF6 \
	GD32_PINMUX_AF('F', 6, AF3)

/* TMR11_CH1 */
#define TMR11_CH1_PB9 \
	GD32_PINMUX_AF('B', 9, AF3)
#define TMR11_CH1_PC12 \
	GD32_PINMUX_AF('C', 12, AF3)
#define TMR11_CH1_PF7 \
	GD32_PINMUX_AF('F', 7, AF3)

/* TMR12_CH1 */
#define TMR12_CH1_PB14 \
	GD32_PINMUX_AF('B', 14, AF9)

/* TMR12_CH2 */
#define TMR12_CH2_PB15 \
	GD32_PINMUX_AF('B', 15, AF9)

/* TMR13_CH1 */
#define TMR13_CH1_PA6 \
	GD32_PINMUX_AF('A', 6, AF9)
#define TMR13_CH1_PF8 \
	GD32_PINMUX_AF('F', 8, AF9)

/* TMR14_CH1 */
#define TMR14_CH1_PA7 \
	GD32_PINMUX_AF('A', 7, AF9)
#define TMR14_CH1_PF9 \
	GD32_PINMUX_AF('F', 9, AF9)

/* TMR1_BRK */
#define TMR1_BRK_PA6 \
	GD32_PINMUX_AF('A', 6, AF1)
#define TMR1_BRK_PB12 \
	GD32_PINMUX_AF('B', 12, AF1)
#define TMR1_BRK_PE15 \
	GD32_PINMUX_AF('E', 15, AF1)

/* TMR1_CH1 */
#define TMR1_CH1_PA8 \
	GD32_PINMUX_AF('A', 8, AF1)
#define TMR1_CH1_PE9 \
	GD32_PINMUX_AF('E', 9, AF1)

/* TMR1_CH1C */
#define TMR1_CH1C_PA7 \
	GD32_PINMUX_AF('A', 7, AF1)
#define TMR1_CH1C_PB13 \
	GD32_PINMUX_AF('B', 13, AF1)
#define TMR1_CH1C_PE8 \
	GD32_PINMUX_AF('E', 8, AF1)

/* TMR1_CH2 */
#define TMR1_CH2_PA9 \
	GD32_PINMUX_AF('A', 9, AF1)
#define TMR1_CH2_PE11 \
	GD32_PINMUX_AF('E', 11, AF1)

/* TMR1_CH2C */
#define TMR1_CH2C_PB0 \
	GD32_PINMUX_AF('B', 0, AF1)
#define TMR1_CH2C_PB14 \
	GD32_PINMUX_AF('B', 14, AF1)
#define TMR1_CH2C_PE1 \
	GD32_PINMUX_AF('E', 1, AF1)
#define TMR1_CH2C_PE10 \
	GD32_PINMUX_AF('E', 10, AF1)

/* TMR1_CH3 */
#define TMR1_CH3_PA10 \
	GD32_PINMUX_AF('A', 10, AF1)
#define TMR1_CH3_PE13 \
	GD32_PINMUX_AF('E', 13, AF1)

/* TMR1_CH3C */
#define TMR1_CH3C_PB1 \
	GD32_PINMUX_AF('B', 1, AF1)
#define TMR1_CH3C_PB15 \
	GD32_PINMUX_AF('B', 15, AF1)
#define TMR1_CH3C_PE12 \
	GD32_PINMUX_AF('E', 12, AF1)

